InformationRegisters/КСУ_ПолученныеНовости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ПолученныеНовости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/КСУ_Новости/Ext/Form/Module.bsl
&НаСервере
Процедура ПрочитаноНаСервере()
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ПолученныеНовости.Дата КАК Дата,
	               |	КСУ_ПолученныеНовости.Пользователь КАК Пользователь,
	               |	ИСТИНА КАК Прочитано,
	               |	КСУ_ПолученныеНовости.Содержание КАК Содержание
	               |ИЗ
	               |	РегистрСведений.КСУ_ПолученныеНовости КАК КСУ_ПолученныеНовости
	               |ГДЕ
	               |	КСУ_ПолученныеНовости.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Выборк = запрос.Выполнить().Выбрать();
	
	Если выборк.Следующий() Тогда
		мен = РегистрыСведений.КСУ_ПолученныеНовости.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(мен, выборк);
		мен.Записать(истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Прочитано(Команда)
	ПрочитаноНаСервере();
	закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Содержание = ЗначениеИзСтрокиВнутр(параметры.новость);
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	имяОрг = сокрлп(Константы.КСУ_НазваниеОрганизации.Получить());
	Если имяОрг = "" Тогда
		Сообщить("Заполните константу ""Название организации"" в настройках КСУ.");
		возврат;
	КонецЕсли;
	
	
	АдресСервера = Константы.КСУ_АдресСервераНовостей.Получить();
	текПольз = ПараметрыСеанса.ТекущийПользователь;
	 Попытка
		Соединение = Новый HTTPСоединение(АдресСервера,,"KSU","BycfqnPfobnf");
	Исключение
		сообщить(ОписаниеОшибки());
		возврат;
	КонецПопытки;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, новый структура("Company,Text,User",имяОрг,Сообщение,строка(ПараметрыСеанса.ТекущийПользователь)));
	СтрокаДляЗапроса = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос("/ksu_news/hs/Support/Comment");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса);
	
	Попытка
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
	Исключение
		сообщить(ОписаниеОшибки());
		возврат;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Сообщить("Сообщение отправлено!");
	Иначе
		сообщить(Ответ);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьНовостиКСУ");
КонецПроцедуры
